W12/W12D2/BenchBnb/BENCHBNB/app/controllers/application_controller.rb

  def current_user
    # Check for session_token
    return nil unless session[:session_token]

    # Return the user associated with the session_token (if token is valid)
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "5Q0MlW5DWLS4r7TjkYo40g"], ["LIMIT", 1]]