W12/W12D2/BenchBnb/BENCHBNB/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches"
SELECT "benches".* FROM "benches" WHERE (lat < '37.809713098290686') AND (lat > '37.74187133792972') AND (lng > '-122.47791534423827') AND (lng < '-122.3920846557617') AND "benches"."seating" BETWEEN $1 AND $2  [["seating", 1], ["seating", 10]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."bench_id" IN ($1, $2, $3)  [["bench_id", 21], ["bench_id", 22], ["bench_id", 24]]
---
    def index
        benches = bounds ? Bench.in_bounds(bounds) : Bench.all

        if params[:minSeating] && params[:maxSeating]
            benches = benches.where(seating: seating_range)
        end

        @benches = benches.includes(:reviews)

SELECT  "benches".* FROM "benches" WHERE "benches"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show
        @bench = Bench.find(params[:id])

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at", "seating") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "test"], ["lat", 37.76886285440744], ["lng", -122.50108963012694], ["created_at", "2022-08-06 01:34:24.238864"], ["updated_at", "2022-08-06 01:34:24.238864"], ["seating", 15]]
---
    def create
        @bench = Bench.create!(bench_params)