W12/W12D2/BenchBnb/BENCHBNB/app/controllers/api/reviews_controller.rb

INSERT INTO "reviews" ("body", "rating", "bench_id", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "best view ever"], ["rating", 5], ["bench_id", 28], ["created_at", "2022-08-16 22:19:29.081959"], ["updated_at", "2022-08-16 22:19:29.081959"], ["author_id", 7]]
---
    def create
        @review = current_user.reviews.new(review_params)

        if @review.save