W12/W12D2/BenchBnb/BENCHBNB/app/views/api/benches/show.json.jbuilder

    json.partial! '/api/benches/bench', bench: @bench
    json.reviewIds @bench.reviews.pluck(:id)
---
SELECT "reviews"."id" FROM "reviews" WHERE "reviews"."bench_id" = $1  [["bench_id", 22]]


@bench.reviews.includes(:author).each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."bench_id" = $1  [["bench_id", 22]]