W6/W6D3/controller/app/controllers/artwork_shares_controller.rb

  def index
    artwork_shares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"