W6/W6D3/controller/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
SELECT "comments".* FROM "comments"
---
  def index
    if params.has_key?(:user_id)
      comments = Comment.where(commenter_id: params[:user_id])
    elsif params.has_key?(:artwork_id)
      comments = Comment.where(artwork_id: params[:artwork_id])
    else
      comments = Comment.all