W6/W6D3/controller/app/controllers/likes_controller.rb

  def index
    if params.has_key?(:user_id)
      likes = Like.includes(:likeable).where(user_id: params[:user_id])
      liked_obj = []
      likes.each {|ele| liked_obj << ele.likeable}
      render json: liked_obj
    elsif params.has_key?(:artwork_id)
      likes = Like.includes(:likeable).where("likes.likeable_type = 'Artwork' AND
      likes.likeable_id = ? ", params[:artwork_id])
      users = []
      likes.each {|ele| users << ele.liker}
      render json: users
    elsif params.has_key?(:comment_id)
      likes = Like.includes(:likeable).where("likes.likeable_type = 'Comment' AND
      likes.likeable_id = ? ", params[:comment_id])
      users = []
      likes.each {|ele| users << ele.liker}
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes"
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]