W6/W6D3/controller/app/controllers/users_controller.rb

  def index

      if params.has_key?(:username)
        userone = User.where(username: params[:username])
        render json: userone
      elsif !user_params.nil? && user_params.has_key?(:username)
        userone = User.where(username: user_params[:username])
        render json: userone
      else
        users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "\"PauloBN\""]]
SELECT "users".* FROM "users" WHERE "users"."username" IS NULL
SELECT "users".* FROM "users"

  def artworks
    artworks = Artwork.where(artist_id: params[:id])
    actual_array = []
    artworks.each{|ele| actual_array << ele }
    placeholder_array = ArtworkShare.where(viewer_id: params[:id]).includes(:artwork)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 3]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 3]]