W6/W6D3/controller/app/controllers/users_controller.rb

  def create
  user = User.new(params.require(:user).permit(:name, :email))
  # replace the `user_attributes_here` with the actual attribute keys
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "\"Paulo\""], ["email", "\"drogo@hotmail.com\""], ["created_at", "2022-02-02 23:18:22.659306"], ["updated_at", "2022-02-02 23:18:22.659306"]]